Hi @garyboyes, 

I was trying to reproduce your issue using the provided details. The configuration I used is Terraform version 1.7.5 with AWS Provider 5.25.0. The only addition I introduced is the `terraform` block to enforce these versions.

Steps:

- Create a file `ssm.tf` with the following content

  ```hcl
  terraform {
   required_version = "1.7.5"
   required_providers {
     aws = {
       source  = "hashicorp/aws"
       version = "~> 5.25.0"
     }
   }
  }
  
  resource "aws_ssm_document" "ssm_document" {
    name          = "aws_fsbp_ssm_4"
    document_type = "Command"
    permissions = {
      type        = "Share"
      account_ids = "All"
    }
    content = <<DOC
    {
      "schemaVersion": "2.2",
      "description": "aws-fsbp-ssm-4",
      "parameters": {
        "Message": {
          "type": "String",
          "description": "Example",
          "default": "Hello World"
        }
      },
      "mainSteps": [
        {
          "action": "aws:runPowerShellScript",
          "name": "example",
          "inputs": {
            "runCommand": [
              "Write-Output {{Message}}"
            ]
          }
        }
      ]
    }
  DOC
  }
  ```

- Run `terraform init` to download the provider
  ```hcl
  ❯ terraform init

  Initializing the backend...
  
  Initializing provider plugins...
  - Finding hashicorp/aws versions matching "~> 5.25.0"...
  - Installing hashicorp/aws v5.25.0...
  - Installed hashicorp/aws v5.25.0 (signed by HashiCorp)
  
  Terraform has created a lock file .terraform.lock.hcl to record the   provider
  selections it made above. Include this file in your version control   repository
  so that Terraform can guarantee to make the same selections by default   when
  you run "terraform init" in the future.
  
  Terraform has been successfully initialized!
  
  You may now begin working with Terraform. Try running "terraform plan"   to see
  any changes that are required for your infrastructure. All Terraform   commands
  should now work.
  
  If you ever set or change modules or backend configuration for   Terraform,
  rerun this command to reinitialize your working directory. If you   forget, other
  commands will detect it and remind you to do so if necessary.
  ```

- Checking terraform and aws provider version are expected

  ```shell
  ❯ terraform version
  Terraform v1.7.5
  on linux_amd64
  + provider registry.terraform.io/hashicorp/aws v5.25.0
  ```
  
- Run `terraform apply`

  ```hcl
  ❯ terraform apply
  
  Terraform used the selected providers to generate the following   execution plan. Resource actions are indicated with the following   symbols:
    + create
  
  Terraform will perform the following actions:
  
    # aws_ssm_document.ssm_document will be created
    + resource "aws_ssm_document" "ssm_document" {
        + arn              = (known after apply)
        + content          = <<-EOT
              {
                  "schemaVersion": "2.2",
                  "description": "aws-fsbp-ssm-4",
                  "parameters": {
                    "Message": {
                      "type": "String",
                      "description": "Example",
                      "default": "Hello World"
                    }
                  },
                  "mainSteps": [
                    {
                      "action": "aws:runPowerShellScript",
                      "name": "example",
                      "inputs": {
                        "runCommand": [
                          "Write-Output {{Message}}"
                        ]
                      }
                    }
                  ]
                }
          EOT
        + created_date     = (known after apply)
        + default_version  = (known after apply)
        + description      = (known after apply)
        + document_format  = "JSON"
        + document_type    = "Command"
        + document_version = (known after apply)
        + hash             = (known after apply)
        + hash_type        = (known after apply)
        + id               = (known after apply)
        + latest_version   = (known after apply)
        + name             = "aws_fsbp_ssm_4"
        + owner            = (known after apply)
        + parameter        = (known after apply)
        + permissions      = {
            + "account_ids" = "All"
            + "type"        = "Share"
          }
        + platform_types   = (known after apply)
        + schema_version   = (known after apply)
        + status           = (known after apply)
        + tags_all         = (known after apply)
      }
  
  Plan: 1 to add, 0 to change, 0 to destroy.
  
  Do you want to perform these actions?
    Terraform will perform the actions described above.
    Only 'yes' will be accepted to approve.
  
  Enter a value: 
  ```
  
- Run AWS CLI to check for document
  
  ```shell
  $ aws ssm get-document --name "aws_fsbp_ssm_4"
  {
      "Name": "aws_fsbp_ssm_4",
      "CreatedDate": "2024-04-06T16:16:53.569000+02:00",
      "DocumentVersion": "1",
      "Status": "Active",
      "Content": "  {\n    \"schemaVersion\": \"2.2\",\n      \"description\": \"aws-fsbp-ssm-4\",\n    \"parameters\": {\n        \"Message\": {\n        \"type\": \"String\",\n          \"description\": \"Example\",\n        \"default\": \"Hello   World\"\n      }\n    },\n    \"mainSteps\": [\n      {\n          \"action\": \"aws:runPowerShellScript\",\n        \"name\":   \"example\",\n        \"inputs\": {\n          \"runCommand\":   [\n            \"Write-Output {{Message}}\"\n          ]\n        }  \n      }\n    ]\n  }\n",
      "DocumentType": "Command",
      "DocumentFormat": "JSON"
  }
  ```

- Run AWS CLI to check for document permissions

  ```shell
   $ aws ssm describe-document-permission --name "aws_fsbp_ssm_4" --permission-type "Share"

  {
      "AccountIds": [
          "all"
      ],
      "AccountSharingInfoList": [
          {
              "AccountId": "all",
              "SharedDocumentVersion": "$DEFAULT"
          }
      ]
  }
  ```
From CLI output and also AWS Management Console the document permissions are as expected. 
Not sure if I missed a step in trying to reproduce - if so , please let me know.
